Revit 2026 API

# ComponentRepeaterRepeatElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<ComponentRepeater> RepeatElements(
	Document document,
	ICollection<ElementId> elementIds
)
```
```vb
Public Shared Function RepeatElements (
	document As Document,
	elementIds As ICollection(Of ElementId)
) As IList(Of ComponentRepeater)
```
```cpp
public:
static IList<ComponentRepeater^>^ RepeatElements(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
static member RepeatElements :
        document : Document *
        elementIds : ICollection<ElementId> -> IList<ComponentRepeater>
```

#### Parameters

document Document

elementIds ICollectionElementId

#### Return Value

IListComponentRepeater

#### Reference

ComponentRepeater Class

Autodesk.Revit.DB Namespace